# ReverseIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectorSet..::..ReverseIterator Method
ConnectorSet Class See Also
---
Retrieve a backward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual ConnectorSetIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overridable Function ReverseIterator As ConnectorSetIterator
```

Visual C++
---
```text
public:
virtual ConnectorSetIterator^ ReverseIterator()
```

# ### Return Value
Returns a backward moving iterator to the set.
# See Also
ConnectorSet Class
Autodesk.Revit.DB Namespace